<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="renderer" content="webkit">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>协议</title>
    <%@ include file="/WEB-INF/view/common/common.jsp" %>
</head>
<body>
<div class="login-layout">
    <%@ include file="/WEB-INF/view/common/contact.jsp" %>
    <div class="same-content agreement-layout">
        <div class="agreement-wrap w1200">
            <div class="agreement-content">
                <h2>用户协议</h2>
                <div class="agreement-item">
                    <p>
                        在您使用宝付国际（美国）有限公司（筹）（“宝付国际”、“我们”）的服务之前，请仔细阅读本协议的条款和条件。您一旦使用我们任何部分的服务，则代表您（“客户”“商户”“您”“任何授权使用者”）同意遵守本用户协议的条款和条件。您声明您的年龄已满18周岁。如果您不同意本用户协议的条款和条件，请不要使用我们的服务。</p>
                    <p>
                        宝付国际可自行变更本用户协议，并在网站上发布变更后的用户协议，我们将会及时通知您关于本用户协议的变更，我们会以页面提示或发送到您的信息或电话或邮件等通知您该等变更。您在用户协议变更后继续使用宝付国际服务即视作您同意此类变更。
                </div>
                <div class="agreement-item">
                    <h3>1.宝付国际服务概述</h3>
                    <p>
                        宝付国际向您提供第三方收款服务，您可以通过宝付国际接收国际业务的付款。宝付国际作为您的代理人，在您的明确授权下，接收电商平台向您支付的款项至您的宝付国际账户，然后通过宝付国际的其他合作伙伴以您所在地的货币形式下发至您的提现银行账户。</p>
                    <p>
                        您理解并接受，您的宝付国际账户不属于存款账户，宝付国际也不是银行、金融机构、资金划拨机构或其它形式的资金服务机构，不会向您支付资金的利息。您也确认宝付国际有权保留宝付国际经营性银行账户中持有的任何资金产生的任何利益。</p>
                </div>
                <div class="agreement-item">
                    <h3>2.注册宝付国际收款账户</h3>
                    <p>从事电子商务活动的中国企业或个人可通过我们的【<a target="_blank" href="https://global.baofu.com/">global.baofu.com</a>】网站
                        申请使用宝付国际收款服务。</p>
                    <p>
                        为了履行监管部门要求的打击恐怖主义集资和洗钱活动的义务，在您注册并申请开立一个宝付账户时，我们要求您向宝付国际提供开立宝付国际收款账户所需的全部信息。如该等信息有任何变化，您应当及时更新您宝付国际收款账户中的信息。您同意并理解，宝付国际可能会通过保密手段向第三方数据库验证您的注册时所提供的全部信息。</p>
                    <p>宝付国际保留拒绝为您开立宝付国际收款账户的权利以及随时因任何原因终止或限制您接受宝付国际收款服务的权利。</p>
                    <p>
                        宝付国际将通过您填写的电子邮箱地址向您电子邮件通知您已开立宝付国际收款账户。您应当采取合理的措施保障您宝付国际收款账户的用户名称和密码安全。如您发现有任何非法使用您宝付国际收款账户的用户名称和密码的情况，您应立即通知我们。如果您允许其他人使用您的宝付国际收款账户，我们将视作您已授权此类使用，您将对此类使用产生的交易和费用承担责任。</p>
                    <p>
                        您可以在您的宝付国际收款账户中查看与您的交易相关的信息。宝付国际虽尽一切努力，但不保证前述信息是准确、完整或及时的，我们建议您定期核对这些信息，如您对这些信息有疑问，请尽快联系宝付国际的客服。</p>
                </div>
                <div class="agreement-item">
                    <h3>3.收款服务</h3>
                    <p>
                        您必须开立了宝付国际收款账户后才能使用我们的收款服务。您的宝付国际收款账户的资金来源仅为经宝付国际批准的电商平台交易获得的资金。未经宝付国际批准的电商平台发送的入账资金宝付国际将拒绝其入账。因拒付有关的费用均由您自行承担。</p>
                    <p>对于买方、电商平台与您之间的业务，宝付国际不承担任何责任，并且您须保证宝付国际不受前述业务造成的任何损害。</p>
                    <p>您不得允许电商平台从宝付国际收款账户中扣款，如果电商平台或任何其它第三方从该账户中扣款，则您应为此向宝付国际负责。</p>
                </div>
                <div class="agreement-item">
                    <h3>4.提现账户结算</h3>
                    <p>您必须通过登录您的宝付国际账户申请资金结算。在您申请提现前，您必须向宝付国际提供您的结算银行账户信息。</p>
                    <p>您必须确保您的提现账户信息准确无误。如果由于您提供了不准确的付款信息导致资金汇入错误的银行账户，我们对此概不负责。</p>
                    <p>宝付国际可依托与宝付国际有结算付款协议并且受到中国管制的第三方支付公司完成您的提现账户结算。</p>
                    <p>宝付国际向您提现账户结算的金额是您申请的提现金额减去任何可能存在的费用。</p>
                </div>
                <div class="agreement-item">
                    <h3>5.费用</h3>
                    <p>宝付国际向您收取的收款服务费计算方式为：【手续费 = 提现金额（美元）&times;
                        1%】。宝付国际有权不定期对费用进行酌情调整，并将调整结果通过公告和邮件的形式向您告知。如您持续使用宝付国际的服务，我们将视为您同意支付所有的费用并且接受调整结果。</p>
                    <p>如果您的结算交易涉及货币兑换，则兑换汇率按照宝付国际在每笔结算交易时告知您的汇率确定。</p>
                </div>
                <div class="agreement-item">
                    <h3>6.责任限制</h3>
                    <p>
                        宝付国际或其服务提供商不会在以下情况下对依据任何合同、过失责任、严格责任或其它法律或公平理论的：(i)任何特殊、意外或间接损害赔偿；(ii)获得替代产品或服务的费用；(iii)数据中断使用或丢失或损坏；或(iv)其金额超过您依据本协议在诉因前十二（12）个月期间支付给宝付国际费用的任何款项承担责任。宝付国际对于超出其合理控制的情况所导致的任何不履行或延误概不负责。</p>
                    <p>对于任何汇入款项，您特此免除电商平台自宝付国际收到相关资金起对该款项的责任。</p>
                    <p>您承认宝付国际将使用银行、第三方支付机构等服务提供商提供宝付国际收款服务。该等服务提供商与您之间没有商业协议，因此服务提供商对您不负有直接的责任。</p>
                    <p>本协议第6条在本协议终止后继续有效。</p>
                </div>
                <div class="agreement-item">
                    <h3>7.保证免责声明</h3>
                    <p>我们“原样”提供宝付国际收款服务。宝付国际及其服务提供商未保证我们的服务没有错误或服务接入将持续不中断。您了解您自己决定从我们的服务下载或通过我们的服务获得内容或服务，风险由您自己承担。</p>
                </div>
                <div class="agreement-item">
                    <h3>8.终止和暂停</h3>
                    <p>
                        宝付国际可在任何时候基于任何理由终止您使用全部或任何部分的宝付国际服务，且立即生效。如果您希望终止本协议或您的宝付国际收款账户，您只需停止使用宝付国际收款服务。本协议依据其性质在协议终止后应当仍然有效的全部条款在协议终止后应继续有效。</p>
                </div>
                <div class="agreement-item">
                    <h3>9.不可抗力</h3>
                    <p>因水灾、火灾、旱灾、台风、地震及其它自然灾害、罢工、骚动、暴乱及战争以及政府行为等不可抗力或者第三方原因造成我们无法为您提供约定的服务，我们不承担任何法律责任。</p>
                </div>
                <div class="agreement-item">
                    <h3>10.知识产权</h3>
                    <p>除非我们另有书面同意，我们网站上的所有知识产权及其他相关权利均为我们所有，任何人不得擅自使用。</p>
                </div>
                <div class="agreement-item">
                    <h3>11.特别说明</h3>
                    <p>宝付国际处于在筹状态，感谢您在我们在筹期间使用宝付国际收款服务，宝付国际不会因为在筹状态而降低我们的服务标准，如在在筹期间出现法律纠纷，将由筹建委员会承担相应的法律责任。</p>
                </div>

            </div>
        </div>
    </div>
</div>
<jsp:include page="../common/footer.jsp"/>
</body>
</html>