package com.baofu.international.global.account.core.common.enums;

import com.system.commons.exception.ErrorCode;
import lombok.AllArgsConstructor;
import lombok.Getter;


/**
 * 错误码枚举类
 * <p>
 * 1.
 * </p>
 *
 * @author wukong
 * @version 1.0.0
 * @date 2017/11/4
 */
@Getter
@AllArgsConstructor
public enum ErrorCodeEnum implements ErrorCode {
    /**
     * 中枢-工具-HttpUtil-异常
     */
    ERROR_CODE_100004("100004", "中枢-工具-HttpUtil-异常"),
    /**
     * 发送手机短信失败
     */
    ERROR_CODE_190003("190003", "发送手机短信失败"),

    /**
     * 发送邮件失败
     */
    ERROR_CODE_190004("190004", "发送邮件失败"),

    /**
     * 密文解密失败
     */
    ERROR_CODE_190005("190005", "密文解密失败"),

    /**
     * 实名认证响应异常
     */
    ERROR_CODE_190006("190006", "实名认证响应异常"),

    /**
     * 汇入申请异常
     */
    ERROR_CODE_190007("190007", "汇入申请异常"),

    /**
     * 查询汇入申请信息异常
     */
    ERROR_CODE_190008("190008", "查询汇入申请信息异常"),

    /**
     * 查询汇入申请信息异常
     */
    ERROR_CODE_190009("190009", "查询汇入申请信息异常"),

    /**
     * 用户名已存在
     */
    ERROR_CODE_190010("190010", "用户名已存在"),

    /**
     * 邮箱已被注册
     */
    ERROR_CODE_190011("190011", "邮箱已被注册，请更换"),

    /**
     * 卡bin信息不能为空
     */
    ERROR_CODE_190013("190013", "卡bin信息不能为空"),

    /**
     * 验证码已失效
     */
    ERROR_CODE_290001("290001", "验证码已失效"),

    /**
     * 验证码错误
     */
    ERROR_CODE_290002("290002", "验证码错误"),

    /**
     * 用户名格式不正确
     */
    ERROR_CODE_290003("290003", "用户名格式不正确"),
    ERROR_CODE_190014("190014", "系统繁忙，请稍后再试"),

    /**
     * redisKey不能为空
     */
    ERROR_CODE_290004("290004", "redisKey不能为空"),
    ERROR_CODE_190015("190015", "正在处理，请勿频繁操作！"),

    ERROR_CODE_190016("190016", "收款账户收支明细已存在"),

    ERROR_CODE_190017("190017", "商户账户余额不足，暂时不能提现"),

    ERROR_CODE_190018("190018", "渠道通知状态不正确"),

    ERROR_CODE_190019("190019", "查询账户余额异常"),

    ERROR_CODE_190020("190020", "商户提现申请明细不存在"),

    ERROR_CODE_190021("190021", "渠道通知状态不正确"),

    ERROR_CODE_190022("190022", "文件格式错误或者不存在"),

    ERROR_CODE_190023("190023", "用户账户信息不存在"),

    ERROR_CODE_190024("190024", "订单不存在"),

    ERROR_CODE_190025("190025", "参数信息异常"),

    ERROR_CODE_190026("190026", "用户转账请求汇总批次不存在"),

    ERROR_CODE_190027("190027", "用户提现请求明细不存在"),

    ERROR_CODE_190028("190028", "请求资金分发商户不合法"),

    ERROR_CODE_190029("190029", "用户该店铺下无可用订单"),

    ERROR_CODE_190030("190030", "凑单服务，未凑齐合适用户订单"),

    ERROR_CODE_190031("190031", "凑单服务异常"),

    ERROR_CODE_190032("190032", "用户该店铺下可用订单订单金额不足"),

    ERROR_CODE_190033("190033", "币种锁定中行汇率不存在"),

    ERROR_CODE_190034("190034", "汇入汇款申请不存在"),

    ERROR_CODE_190035("190035", "收款账户收支明细收支方向不正确"),

    ERROR_CODE_190036("190036", "用户代付申请API失败"),

    ERROR_CODE_190037("190037", "提现下发申请不存在"),

    /********** 用户错误信息 *********/
    ERROR_CODE_200001("200001", "账户或密码输入不正确"),

    ERROR_CODE_200002("200002", "您的账号已被锁定，请在30分钟后重试"),

    ERROR_CODE_200003("200003", "用户状态不正确"),

    /**
     * 两次输入密码不一致
     */
    ERROR_CODE_190100("190100", "两次输入密码不一致"),

    /**
     * 两次输入密码不一致
     */
    ERROR_CODE_190101("190101", "旧密码输入有误"),

    /**
     * 生成验证码失败
     */
    ERROR_CODE_190102("190102", "生成验证码失败"),

    /**
     * 密保问题答案不一致
     */
    ERROR_CODE_190103("190103", "密保问题答案不一致"),
    /**
     * 境外账户申请信息获取异常
     */
    ERROR_CODE_220001("220001", "境外账户申请信息获取异常"),
    /**
     * 境外账户申请信息申请异常
     */
    ERROR_CODE_220002("220002", "收款账户开户渠道响应失败"),
    /**
     * 境外账户申请信息申请异常
     */
    ERROR_CODE_220003("220003", "境外账户申请信息申请异常"),
    /**
     * 境外账户申请组装客户信息异常
     */
    ERROR_CODE_220004("220004", "境外账户申请组装客户信息异常"),
    /**
     * 境外账户申请信息申请异常
     */
    ERROR_CODE_220005("220005", "该账户已经申请请勿重复申请"),
    /**
     * 用户客户信息不存在
     */
    ERROR_CODE_190104("190104", "用户客户信息不存在"),

    /**
     * 邮箱格式不正确
     */
    ERROR_CODE_290005("290005", "邮箱格式不正确"),

    /**
     * 手机号格式不正确
     */
    ERROR_CODE_290006("290006", "手机号格式不正确"),

    /**
     * 用户店铺信息查询为空
     */
    ERROR_CODE_190105("190105", "用户店铺信息查询为空"),

    /**
     * 用户银行卡信息未找到
     */
    ERROR_CODE_190106("190106", "用户银行卡信息未找到"),

    /**
     * 用户短信息验证码已经过期
     */
    ERROR_CODE_190201("190201", "用户短信息验证码已经过期"),

    /**
     * 用户密保问题不匹配
     */
    ERROR_CODE_190202("190202", "用户密保问题不匹配"),

    /**
     * 未查询到用户密保问题
     */
    ERROR_CODE_190203("190203", "未查询到用户密保问题"),

    /**
     * 未查询到用户注册手机信息
     */
    ERROR_CODE_190204("190204", "未查询到用户注册信息"),

    /**
     * 查询企业用户信息异常
     */
    ERROR_CODE_190205("190205", "查询企业用户信息异常"),

    /**
     * 企业用户信息查询参数异常
     */
    ERROR_CODE_190206("190206", "企业用户信息查询参数异常"),

    /**
     * 银行卡认证失败
     */
    ERROR_CODE_190207("190207", "银行卡认证失败"),

    /**
     * 未查询到当前银行卡信息
     */
    ERROR_CODE_190208("190208", "未查询到当前银行卡信息"),

    /**
     * 银行状态异常
     */
    ERROR_CODE_190209("190209", "银行状态异常"),

    /**
     * 邮箱不能为空
     */
    ERROR_CODE_290007("290007", "邮箱不能为空"),

    /**
     * 验证码不能为空
     */
    ERROR_CODE_290008("290008", "验证码不能为空"),

    /**
     * 手机号不能为空
     */
    ERROR_CODE_290009("290009", "手机号不能为空"),

    ERROR_CODE_290017("290013", "手机号已被绑定"),

    /**
     * 用户支付密码校验失败
     */
    ERROR_CODE_190210("190210", "用户支付密码校验失败"),

    /**
     * 用户号不允许为空
     */
    ERROR_CODE_190211("190211", "参数信息不合法"),

    /**
     * 用户已经添加过该银行卡
     */
    ERROR_CODE_190212("190212", "用户已经添加过该银行卡，无需再次添加"),

    /**
     * 用户密码信息不存在
     */
    ERROR_CODE_190213("190213", "用户密码信息不存在"),

    /**
     * 查询系统支持银行卡
     */
    ERROR_CODE_190214("190214", "查询系统支持银行卡异常，暂未查询到数据"),

    /**
     * 查询系统支持银行卡
     */
    ERROR_CODE_190215("190215", "用户尚未进行实名认证，暂时无法进行提现银行卡操作"),

    /**
     * 查询系统支持银行卡
     */
    ERROR_CODE_190216("190216", "用户输入开户行和银行卡实际开户行不匹配"),

    /**
     * 查询系统支持银行卡
     */
    ERROR_CODE_190217("190217", "用户姓名与用户实名信息不一致，无法添加银行卡"),
    /**============个人+企业错误信息  看清楚再加错误码！！====================*/

    /**
     * 个人用户对象信息不存在
     */
    ERROR_CODE_199001("199001", "个人用户信息不存在"),

    /**
     * 会员号不能为空
     */
    ERROR_CODE_199002("199002", "会员号不能为空"),

    /**
     * 币种不能为空
     */
    ERROR_CODE_199003("199003", "币种不能为空"),

    /**
     * 渠道不能为空
     */
    ERROR_CODE_199004("199004", "渠道不能为空"),

    /**
     * 未查询到企业用户数据
     */
    ERROR_CODE_190407("190407", "未查询到企业用户数据"),

    /**============认证校验错误信息  看清楚再加错误码！！====================*/
    /**
     * 卡信息有误或暂不支持该卡
     */
    ERROR_CODE_190400("190400", "卡信息有误或暂不支持该卡"),

    /**
     *
     */
    ERROR_CODE_290012("290012", "ftp信息不存在"),

    /**
     * 个人实名认证失败
     */
    ERROR_CODE_190401("190401", "个人实名认证失败"),

    /**
     * 企业实名认证失败
     */
    ERROR_CODE_190402("190402", "企业实名认证失败"),

    /**
     * 添加银行卡信息失败
     */
    ERROR_CODE_190403("190403", "添加银行卡失败"),

    /**
     * 用户资质信息查询异常
     */
    ERROR_CODE_190404("190404", "用户资质信息查询异常"),

    /**
     * 不支持的卡类型
     */
    ERROR_CODE_190405("190405", "不支持的卡类型"),

    /**
     * 邮箱已使用
     */
    ERROR_CODE_190406("190406", "您的邮箱已被使用"),

    /**============认证校验错误信息====================*/

    /**
     * 60秒内仅能获取一次验证码，请稍后重试
     */
    ERROR_CODE_290010("290010", "60秒内仅能获取一次验证码，请稍后重试"),

    /**
     * 查询 卡bin 异常信息
     */
    ERROR_CODE_290011("290011", "查询卡bin信息为空"),

    /**
     * 安全问题不存在
     */
    ERROR_CODE_290014("290013", "安全问题不存在"),
    /**
     * 卖家编号信息已被使用
     */
    ERROR_CODE_290015("290015", "卖家编号信息已被使用"),
    /**
     * 您的信息已经在其他地方更新
     */
    ERROR_CODE_290016("290016", "您的信息已经在其他地方更新，请确认"),

    /**
     * 您的信息已经在其他地方更新
     */
    ERROR_CODE_290013("290013", "账户表信息为空"),

    /**
     * 您的信息已经在其他地方更新
     */
    ERROR_CODE_290024("290024", "上传CSV文件有误"),

    /**
     * 文件格式为UTF-8
     */
    ERROR_CODE_290025("290025", "上传CSV文件编码格式有误"),

    ;

    /**
     * 错误码
     */
    private String errorCode;


    /**
     * 异常描述
     */
    private String errorDesc;

    /**
     * 设置错误描述信息
     *
     * @param errorMsg 错误信息
     */
    @Override
    public void setErrorDesc(String errorMsg) {
        this.errorDesc = errorMsg;
    }
}
